# Напишите программу, вычисляющую значение ⌈x⌉ +⌊x⌋ позаданному вещественному числу x.
import math
x = float(input())
a = math.ceil(x)
b = math.floor(x)
print(a + b)



