# Напишите программу, которая определяет наименьшее из двух чисел.
a = int(input())
b = int(input())

if a > b :
    print(b)
else:
    print(a)