# Напишите программу, которая считывает длины двух катетов в прямоугольном треугольнике и выводит его площадь
# s = 0,5 * a * b

a = float(input())
b = float(input())
s = float(0.5 * a * b)
print(s)