# В одну строку 1
# На вход программе подается строка текста, содержащая слова.
# # Напишите программу, которая выводит слова введенной строки в столбик.

text = input()
x = text.replace(" ", "\n")
print(x)